quiz/src/Documents/Квиз/Квиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Квиз</name>
  <registerRecords>AccumulationRegister.ТурнирнаяТаблица</registerRecords>
  <attributes>
    <name>Игра</name>
    <type>
      <types>CatalogRef.Игры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Раунды</name>
    <attributes>
      <name>Раунд</name>
      <type>
        <types>CatalogRef.Раунды</types>
      </type>
    </attributes>
    <attributes>
      <name>СоСписаниемБаллов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТурнирнаяТаблица</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>Раунд</name>
      <type>
        <types>CatalogRef.Раунды</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

quiz/src/AccumulationRegisters/ТурнирнаяТаблица/ТурнирнаяТаблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТурнирнаяТаблица</name>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

quiz/src/InformationRegisters/РезультатыКвиза/РезультатыКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыКвиза</name>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

quiz/src/Documents/Квиз/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ТурнирнаяТаблица Приход
	Движения.ТурнирнаяТаблица.Записывать = Истина;
	Для Каждого ТекСтрокаТурнирнаяТаблица Из ТурнирнаяТаблица Цикл
		Движение = Движения.ТурнирнаяТаблица.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Команда = ТекСтрокаТурнирнаяТаблица.Команда;
		Движение.Раунд = ТекСтрокаТурнирнаяТаблица.Раунд;
		Движение.КоличествоБаллов = ТекСтрокаТурнирнаяТаблица.КоличествоБаллов;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ЗаполнитьРаунды() Экспорт 
	
	ЭтотОбъект.Раунды.Очистить();
	
	Для Каждого СтрокаРаунда из Игра.Раунды Цикл
		Раунд = ЭтотОбъект.Раунды.Добавить();
		Раунд.Раунд = СтрокаРаунда.Раунд;
	конецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если не ЭтоНовый() Тогда 
		ТурнирнаяТаблица.Очистить();
		РезультатыКвиза = РегистрыСведений.РезультатыКвиза.ПолучитьРезультатыКвиза(Ссылка);  
		
		Пока РезультатыКвиза.Следующий() Цикл
			
			ТекСтрокаРаунд = Раунды.Найти(РезультатыКвиза.Раунд);
			
			КоличествоБаллов = РезультатыКвиза.КоличествоБаллов;
			
			Если ТекСтрокаРаунд.СоСписаниемБаллов Тогда
				КоличествоБаллов = РезультатыКвиза.КоличествоБаллов - РезультатыКвиза.ОтрицательныеБаллы;
			КонецЕсли; 
			
			СтрокаТТ = ТурнирнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТТ, РезультатыКвиза);
			СтрокаТТ.КоличествоБаллов = КоличествоБаллов;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
